cf/InformationRegisters/НоменклатураПартнеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураПартнеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АртикулПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроизводства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/НоменклатураПартнеров/Ext/ManagerModule.bsl
Процедура УстановитьРеквизитСпр(РеквУст, РеквДай, Изменился)
	
	Если Не ЗначениеЗаполнено(РеквУст) И РеквУст <> РеквДай Тогда
		Изменился = Истина;
		РеквУст = РеквДай; КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьИУстановитьСоответвияРеквизитовСправочникаРегиструНоНеЗаписывать(СпрОбъект, Запись, Изменился) Экспорт
	
	УстановитьРеквизитСпр(СпрОбъект.Поставщик, 				Запись.Контрагент, 			Изменился);
	УстановитьРеквизитСпр(СпрОбъект.АртикулПоставщика, 		Запись.АртикулПоставщика, 	Изменился);
	УстановитьРеквизитСпр(СпрОбъект.КомментарийПоставщика, 	Запись.Комментарий, 		Изменился);
	УстановитьРеквизитСпр(СпрОбъект.СрокПроизводства, 		Запись.СрокПроизводства, 	Изменился);
	УстановитьРеквизитСпр(СпрОбъект.СрокДоставки, 			Запись.СрокДоставки, 		Изменился);
	
КонецПроцедуры
